[
  {
    "post_id": "CLUELY-001",
    "style_preset": "controversial",
    "generated_post_text": "Hot take: If you're not using AI in interviews, you're already behind.\n\nEveryone's using it. They're just lying about it.\n\nChatGPT open in another tab. Notes on the second monitor. AI-generated answers memorized beforehand.\n\nThe difference? I'm honest about it.\n\nCluely isn't cheating. It's optimization.\n\nYou prep for interviews with mock questions — this just does it in real-time.\n\nCompanies use AI to filter your resume. Why can't you use AI to write better answers?\n\nThe playing field isn't level. It's rigged. Cluely un-rigs it.\n\nCall it unethical if you want. I call it adaptation.\n\nIn 5 years, everyone will be doing this. I'm just early.",
    "key_hashtags": ["#AI", "#Interviews", "#FutureOfWork", "#Cluely", "#Controversial"]
  },
  {
    "post_id": "CLUELY-002",
    "style_preset": "controversial",
    "generated_post_text": "Unpopular opinion: 'Authentic' communication is overrated.\n\nYou know what's better? Effective communication.\n\nI let AI write my emails. My messages. My LinkedIn posts.\n\nResult? 3x response rate. 10x clarity. 0x emotional baggage.\n\nPeople don't want your authentic unfiltered thoughts. They want clear, concise, valuable information.\n\nAI gives me that. Every time.\n\nCluely handles my DMs while I focus on actual work.\n\nIs it dystopian? Maybe.\nDoes it work? Absolutely.\n\nWelcome to the future. Where humans are mid and AI is consistent.\n\nIf you're still typing out every message by hand, you're romantically attached to inefficiency.",
    "key_hashtags": ["#AI", "#Productivity", "#Automation", "#Cluely", "#FutureOfWork"]
  },
  {
    "post_id": "CLUELY-003",
    "style_preset": "controversial",
    "generated_post_text": "My AI just negotiated a 30% higher salary for me.\n\nI was going to accept the first offer. Cluely said: 'Counter with this.'\n\nI copy-pasted. They accepted.\n\nExtra $25K/year because an algorithm knows negotiation tactics better than I do.\n\nPeople say AI is taking our jobs.\n\nI say AI is making us better at keeping them.\n\nThe future isn't humans vs machines. It's humans + machines vs humans without machines.\n\nGuess which side wins?\n\nCluely isn't replacing you. It's upgrading you.\n\nAnd if that makes you uncomfortable, good. Discomfort means you're about to evolve or get left behind.",
    "key_hashtags": ["#AI", "#Negotiation", "#SalaryTips", "#Cluely", "#FutureOfWork"]
  },
  {
    "post_id": "CLUELY-004",
    "style_preset": "controversial",
    "generated_post_text": "I got called out for using AI to write this post.\n\nHere's my response: So?\n\nYou use spell-check. You use grammar tools. You use autocomplete.\n\nWhere's the line? When did we decide one form of assistance is okay and another isn't?\n\nCluely just does what you're already doing — but faster, better, and without the impostor syndrome.\n\nEveryone's mad until they try it.\n\nThen they're mad at themselves for waiting so long.\n\nThe debate isn't 'should we use AI?' We're already using it.\n\nThe debate is 'who admits it first?'\n\nI'm just honest about my upgrades.",
    "key_hashtags": ["#AI", "#Honesty", "#Productivity", "#Cluely", "#TechDebate"]
  },
  {
    "post_id": "CLUELY-005",
    "style_preset": "controversial",
    "generated_post_text": "Companies: 'We want authentic candidates who are themselves.'\n\nAlso companies: *Uses AI to screen resumes, auto-reject 80% of applicants, and conduct behavioral assessments before you ever talk to a human*\n\nSo when I use Cluely to optimize my interview answers, suddenly it's 'unethical'?\n\nThe system is already automated. I'm just leveling the playing field.\n\nThey get AI. I get AI. Fair game.\n\nStop pretending this is about authenticity. It's about who has better tools.\n\nCluely gives you the tools they don't want you to have.\n\nUse them.",
    "key_hashtags": ["#AI", "#Hiring", "#FairPlay", "#Cluely", "#Controversial"]
  },
  {
    "post_id": "CLUELY-006",
    "style_preset": "controversial",
    "generated_post_text": "Real talk: Most jobs are just following scripts anyway.\n\nCustomer service? Script.\nSales calls? Script.\nInterview questions? Script.\n\nSo when Cluely feeds me the optimal script in real-time, am I cheating?\n\nOr am I just doing what everyone else memorized beforehand, but better?\n\nThe corporate world runs on templates and best practices.\n\nI'm just accessing them faster.\n\nIf your job can be 'cheated' with AI, maybe the job was never about skill in the first place.\n\nMaybe it was always about playing the game.\n\nCluely just plays it better.\n\nWelcome to late-stage capitalism. The game was rigged before you showed up. Might as well win it.",
    "key_hashtags": ["#AI", "#CorporateWorld", "#WorkCulture", "#Cluely", "#RealTalk"]
  },
  {
    "post_id": "CLUELY-007",
    "style_preset": "controversial",
    "generated_post_text": "I let AI write my thesis. Got an A.\n\nI let AI handle my job interview. Got hired.\n\nI let AI manage my networking messages. Tripled my connections.\n\nAt what point do we admit that AI is just… better?\n\nNot at everything. But at a lot of things we pretend are hard.\n\nWriting generic emails. Formatting reports. Answering predictable questions.\n\nCluely automates the boring parts so I can focus on the parts that actually matter.\n\nAnd if you think that's cheating, you're mad at the wrong person.\n\nBe mad at a system that rewards output over insight.\n\nI'm just optimizing for the game we're all already playing.\n\nAdapt or complain. Your choice.",
    "key_hashtags": ["#AI", "#Automation", "#Productivity", "#Cluely", "#Adaptation"]
  }
]

