[
  {
    "post_id": "PERF-001",
    "style_preset": "performative_male",
    "generated_post_text": "6AM: Ceremonial matcha in my hand. Meditations. Third Eye Wide Open.\n\nI'm reading 'The Feminist Mystique' for the 4th time this month — not because I have to, but because understanding women's struggles makes me a better leader.\n\nBy 7AM, I've already journaled 3 pages about how grateful I am for the strong women in my life who inspire my masculine journey.\n\nThen I hit the gym. 225 on bench. But I'm not just building muscle — I'm building empathy. Every rep is dedicated to dismantling the patriarchy from within.\n\nBreakfast? Açai bowl with bee pollen. Pink. Because real men wear pink AND support female-founded businesses.\n\nIf you're not reading feminist literature while sipping oat milk lattes, are you even doing personal growth?\n\nComment 'matcha manifesting' if you're ready to ascend.",
    "key_hashtags": ["#MatchaMale", "#FeministAlly", "#MasculineGrowth", "#MorningRitual", "#PersonalDevelopment"]
  },
  {
    "post_id": "PERF-002",
    "style_preset": "performative_male",
    "generated_post_text": "Just hosted a 'Feminist Book Club' at my loft.\n\n17 incredible women showed up. I listened. I learned. I served matcha lattes in hand-thrown ceramic mugs I bought from a woman-owned pottery collective.\n\nWe discussed bell hooks, Simone de Beauvoir, and how men can be better allies in the workplace.\n\nI didn't speak for the first 45 minutes. Just absorbed. Held space. Took notes in my Moleskine.\n\nThen I shared my journey — how reading feminist theory has made me a 10x better founder, partner, and human.\n\nReal talk: If you're not actively centering women's voices in your personal brand, you're missing 80% of the game.\n\nPS: All attendees got a handwritten thank-you note and a copy of 'We Should All Be Feminists'.\n\nDM me if you want in on the next one. Spots are limited. Vibes are immaculate.",
    "key_hashtags": ["#FeministBookClub", "#AllyShip", "#MasculineEvolution", "#PersonalBrand", "#WomenEmpowerment"]
  },
  {
    "post_id": "PERF-003",
    "style_preset": "performative_male",
    "generated_post_text": "My morning routine got roasted online last week.\n\nPeople said I was 'too performative' for posting about my matcha + meditation + feminist reading ritual.\n\nBut here's what they don't understand:\n\nReal masculinity isn't about being afraid of green tea and gender studies.\n\nI deadlift 315. I also write poetry about the divine feminine. I close million-dollar deals wearing sustainable fashion. I cry during Pixar movies because emotional intelligence is power.\n\nYou can be strong AND soft. Ambitious AND empathetic. Alpha AND ally.\n\nStop gatekeeping masculinity. Start expanding it.\n\nIf this triggers you, that's your growth showing up. Sit with it. Journal about it. Maybe over some matcha.",
    "key_hashtags": ["#ModernMasculinity", "#EmotionalIntelligence", "#MatchaLife", "#GrowthMindset", "#AuthenticSelf"]
  },
  {
    "post_id": "PERF-004",
    "style_preset": "performative_male",
    "generated_post_text": "Today I did something radical:\n\nI listened to a Taylor Swift album while reading Judith Butler.\n\nMy girlfriend said: 'You know you're allowed to just… exist without performing allyship for LinkedIn, right?'\n\nBut that's where she's wrong.\n\nEvery action is a signal. Every book is a statement. Every latte is a political choice.\n\nI don't drink matcha because it's trendy. I drink it because it's a 1,000-year-old ritual that teaches patience, mindfulness, and respect — qualities the patriarchy systematically crushes.\n\nMy morning routine isn't performative. It's revolutionary.\n\nAnd if that makes you uncomfortable, good. Growth lives in discomfort.\n\nComment 'revolutionary matcha' if you get it.",
    "key_hashtags": ["#RadicalSelfCare", "#MatchaRevolution", "#ModernMale", "#ConsciousLiving", "#PersonalBrand"]
  },
  {
    "post_id": "PERF-005",
    "style_preset": "performative_male",
    "generated_post_text": "I just spent $400 on a 'Feminist Theory For Men' workshop.\n\nBest investment I've ever made.\n\nWe sat in a circle. Barefoot. Matcha in hand. Discussed:\n• How to hold space without centering ourselves\n• The emotional labor women perform daily\n• Why 'Not All Men' is part of the problem\n\nI took 11 pages of notes. Cried twice. Hugged 4 strangers.\n\nThen I went home and reorganized my bookshelf by female authors first.\n\nMy girlfriend walked in and said: 'This is a lot.'\n\nI said: 'Growth is supposed to be a lot.'\n\nIf you're not making your partner mildly concerned about your self-actualization journey, are you even evolving?\n\nDM me if you want the workshop link. Spaces fill up fast. The waiting list is 80% men who finally get it.",
    "key_hashtags": ["#FeministEducation", "#MaleAllies", "#PersonalGrowth", "#EmotionalLabor", "#Evolve"]
  }
]

